#include <stdio.h>
#include <locale.h>
void main() {
	setlocale(LC_ALL, "Rus");
	//1
	int A, B;
	printf("Введите А и В ");
	scanf_s("%i %i", &A, &B);
	if ((A > 2) & (B <= 3)) {
		printf("Высказывание справедливо\n");
	}
	else {
		printf("Высказывание не справедливо\n");
	}
	//2
	int C;
	printf("Введите А, В и C ");
	scanf_s("%i %i %i", &A, &B, &C);
	if ((A < B) & (B < C)) {
		printf("Высказывание справедливо\n");
	}
	else {
		printf("Высказывание не справедливо\n");
	}
	//3
	printf("Введите число ");
	scanf_s("%i", &A);
	if (((A % 2) == 0) & ((A / 100) == 0) & ((A / 10) != 0)) {
		printf("Высказывание справедливо\n");
	}
	else {
		printf("Высказывание не справедливо\n");
	}
	//4
	printf("Введите число ");
	scanf_s("%i", &A);
	if ((A / 100) > ((A / 10) % 10) > (A % 10)) {
		printf("Высказывание справедливо\n");
	}
	else if ((A / 100) < ((A / 10) % 10) < (A % 10)) {
		printf("Высказывание справедливо\n");
	}
	else {
		printf("Высказывание не справедливо\n");
	}
	//5
	printf("Введите число ");
	scanf_s("%i", &A);
	if (((A / 1000) == (A % 10)) & (((A / 100) % 10) == ((A % 100) / 10))) {
		printf("Высказывание справедливо\n");
	}
	else {
		printf("Высказывание не справедливо\n");
	}
	//6
	printf("Введите А, В и C ");
	scanf_s("%i %i %i", &A, &B, &C);
	if ((A * A) == ((B * B) + (C * C))) {
		printf("Высказывание справедливо\n");
	}
	else if ((B * B) == ((A * A) + (C * C))) {
		printf("Высказывание справедливо\n");
	}
	else if ((C * C) == ((A * A) + (B * B))) {
		printf("Высказывание справедливо\n");
	}
	else {
		printf("Высказывание не справедливо\n");
	}
	//7
	printf("Введите А, В и C ");
	scanf_s("%i %i %i", &A, &B, &C);
	if ((A < (B + C)) & (B < (A + C)) & (C < (A + B))) {
		printf("Высказывание справедливо\n");
	}
	else {
		printf("Высказывание не справедливо\n");
	}
}